Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.SetTemporaryStateForAll Method
 Sets temporary visualization state (red, blue, green and transparency) for all model objects
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetTemporaryStateForAll(
	Color color
)
Public Shared Function SetTemporaryStateForAll (
	color As Color
) As Boolean
Parameters
color
Type: Tekla.Structures.Model.UI.Color
The temporary state for all model objects.
Return Value
Type: Boolean
True if the temporary state could be set.
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace